<?php

declare(strict_types=1);

/*
 * Написати програму на PHP, яка реалізує клас для роботи зі списком завдань. Завдання мають зберігатися у файлі. Клас повинен мати наступні методи:

addTask($taskName, $priority) - метод, який додає завдання з назвою $taskName та пріоритетом $priority до списку завдань.

deleteTask($taskId) - метод, який видаляє завдання зі списку за ідентифікатором $taskId.

getTasks() - метод, який повертає всі завдання зі списку відсортовані за пріоритетом в порядку спадання.

completeTask($taskId) - метод, який відмічає завдання з ідентифікатором $taskId як виконане.

Також програма повинна мати перелічення (enumeration) для можливих станів завдання: "виконано", "не виконано".

Для реалізації треба використати роботу з масивами, циклами та умовними операторами, програма має зберігати список завдань у файлі та зчитувати його з файлу при кожному запуску програми, щоб зберегти дані між сеансами роботи.
 */

use homeworks\TaskList;

require_once 'TaskList.php';

try {
    $taskList = new TaskList('tasks.txt');

    $taskList->addTask(" 1 ", 6);
    $taskList->addTask(" 2 ", 7);
    $taskList->addTask(" 3 ", 8);


    $taskList->deleteTask('123456789');


    $taskId = '123456789';
    if ($taskList->completeTask($taskId)) {
        return true;
    }
    return false;


} catch (Exception $e) {
};



