<?php


/*
Виконання аналізу власного коду або коду з відкритих джерел на предмет відповідності стандартам PHP FIG.

Можете вибрати будь-який стандарт та дослідити його використання в коді.



Обробленно та виправленно згідно стандартам PSR-1

1,Об'явлення PHP та strict_types: Додав об'явлення PHP та declare(strict_types=1); в початок файлу.

2,Простори імен та використання файлів: Додав простір імен та організував використання файлів в усіх файлах.
namespace MyApp;
require_once 'MathFunction.php';
require_once 'TextFunction.php';


Обробленно та виправленно згідно стандартам PSR-2

1,Використання табуляцій для відступів:
Замінив пробіли на табуляції для відступів у всьому коді.

2,Пробіли після ключових слів:
Додав пробіл після ключових слів для покращення читабельності.


Обробленно та виправленно згідно стандартам PSR-12

1,Розміщення скобок:
Перемістив відкриваючу фігурну дужку { на той же рядок, що і ключове слово, з одним пробілом після нього.

2,Імена методів:
Виправив імена методів на camelCase.
*/
echo "Hello World!";



